// Reverse Proxy
// ! По умолчанию в Reverse Proxy включен Mux.
//
// Обратный прокси - это посредник между вашим компьютером и веб-сервером. Обратный прокси скрывает клиентов (ваш компьютер, телефон и т.п) от веб-серверов, делая веб-серверы недоступными для прямого контакта с клиентами. Для работы Reverse Proxy мы будем настраивать Bridges (мосты) и Portals (порталы).
//
###############################################################################################
//
// 1. Bridges (мосты) — это компоненты, которые помогают установить связь с порталами. Мосты занимаются исходящим трафиком и перенаправляют запросы к нужным внутренним ресурсам или серверам. Это как почтовый пересыльщик, который доставляет письма по нужным адресам. 
//
//
// "tag" — имя вашего моста. Может быть использован в маршрутизации (routing configuration).
// Пример записи: "tag": "bridge45"
//
// "domain" — домен (или поддемен), который будет использоваться только для связи моста (Bridge) и портала (Portal). Не обязательно должно существовать в реальности. Если мост и портал связаны с одними и теми же сайтами или ресурсами, то домен у моста и портала будет одинаковым.
// Пример записи: "domain": "test.xray.com"
//
// Также для Bridges нужны настройки двух outbound (одно для подключения к порталу и другое для передачи фактического трафика) и чтобы различать эти два типа трафика нужен Routing, дальнейшая инструкция будет в соответсвующих файлах "08_outbounds" и "10_routing".
//
###############################################################################################
//
// 2. Portals (порталы) — это входные точки для обратного прокси. Они получают соединения от мостов и пользователей, а затем определяют, что делать с этим трафиком. Это как ворота, через которые проходят люди и грузы, и их решение, как направить каждого из них. 
//
//
// "tag" — имя вашего портала.
// Пример записи: "tag": "12portal"
//
// "domain" — домен (или поддемен), который будет направлен к этому порталу для обработки. Если мост и портал связаны с одними и теми же сайтами или ресурсами, то домен у моста и портала будет одинаковым.
// Пример записи: "domain": "test.xray.com"
//
// Также для Portal нужны настройки двух inbound (одно для приема соединений от моста и другое для приема фактического трафика) и чтобы различать эти два типа трафика нужен Routing, дальнейшая инструкция будет в соответсвующих файлах "07_inbounds" и "10_routing".
//
###############################################################################################
//
// Готовая конфигурация:
// 1. Моста

{
  "bridges": [
    {
      "tag": "bridge45",
      "domain": "test.xray.com"
    }
  ]
}
// 2. Портала

{
  "portals": [
    {
      "tag": "12portal",
      "domain": "test.xray.com" // Должен совпадать с конфигурацией Bridge (моста)
    }
  ]
}
{
}